## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:124" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:124" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:3b4aa6552632b8b23c9f95915eca4db3bf2b6dbd5964a9b6d6f7808a182b9280" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:76e591266dda4c4099ca20e2549e0f448bc318de8a7157ceedf20e559c69d3e1"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 124 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "aa58d7f2c1123b3ad7048bce2dd4c377-6" -> "9aec4e89c018919741d557f4baa1d761"
        id                     = "graphql.9aec4e89c018919741d557f4baa1d761.zip"
        tags                   = {}
      ~ version_id             = "wSQlE__OW0bxMM0.Lx.YK.sikB0cgX.x" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "ada4a30aba929324eb23ead6dd3883bf-5" -> "49f6291dc84bb27b95f10c7de8148425"
        id                     = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip"
        tags                   = {}
      ~ version_id             = "t1_IdzYPMc1bhkFsbkq1hGtF3uCklcdz" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.4febb565357cbdc0dc8ef3e03587ec5b.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2e0f8ae80930be500061c9c4b3692a7d-4" -> "f656035ae26fb7ab6ff388c2c2852228"
      ~ id                     = "python.4febb565357cbdc0dc8ef3e03587ec5b.zip" -> (known after apply)
      ~ key                    = "python.4febb565357cbdc0dc8ef3e03587ec5b.zip" -> "python.f656035ae26fb7ab6ff388c2c2852228.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "4febb565357cbdc0dc8ef3e03587ec5b" -> "f656035ae26fb7ab6ff388c2c2852228"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "W9b4YjMnhtWntH1rZygH496i.tSO5.cl" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "299c223d70751092c677cf39c495e0dd" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        id                     = "dist/200.html"
      ~ source_hash            = "299c223d70751092c677cf39c495e0dd" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        tags                   = {}
      ~ version_id             = "txm1FFqB37m.tYfkxeBD3ezStPmGa9Rf" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3feaa807df1027ce41fa478e6468793f" -> "6db90bfb1a352bb86ee5fbfca83e1f18"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "3feaa807df1027ce41fa478e6468793f" -> "6db90bfb1a352bb86ee5fbfca83e1f18"
        tags                   = {}
      ~ version_id             = "Ucm8C_2KX9.omwZdyPSu.7pGybxkvLXI" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "e1f08ce6712cb55816956cc1a3db4050" -> "5cb73770b0e64e3281a1477ced1019ac"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "e1f08ce6712cb55816956cc1a3db4050" -> "5cb73770b0e64e3281a1477ced1019ac"
        tags                   = {}
      ~ version_id             = "Vz5139g.tjobWy4PsE3HmPlcm.b0y6hG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "299c223d70751092c677cf39c495e0dd" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        id                     = "dist/index.html"
      ~ source_hash            = "299c223d70751092c677cf39c495e0dd" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        tags                   = {}
      ~ version_id             = "Bsx6d8QrOpiv0rNxmvxZjfp4r2aS1qFy" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7185f465.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "1d8b72d5cbcee32765bd4cfb13768ddb"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.7185f465.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7185f465.js"
+       source_hash            = "1d8b72d5cbcee32765bd4cfb13768ddb"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7185f465.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "3b6b61b80017ed2a756a2cec1364fac3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.7185f465.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7185f465.js.LICENSE.txt"
+       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.ef386e6b.js"] will be destroyed
  # (because key ["static/js/app.ef386e6b.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.ef386e6b.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "d10b564ba4d1a022eb9ce19d0655042e" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.ef386e6b.js" -> null
-       key                    = "dist/static/js/app.ef386e6b.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.ef386e6b.js" -> null
-       source_hash            = "d10b564ba4d1a022eb9ce19d0655042e" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "vWTzJJQz5ZKIBabQE8TI5mVbnRc__vjz" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.ef386e6b.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.ef386e6b.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.ef386e6b.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.ef386e6b.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.ef386e6b.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.ef386e6b.js.LICENSE.txt" -> null
-       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "H2u47.z9Vu9ooBE..ItyI8CIxLn84EEq" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-05-01T17:36:23.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:91" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:91/invocations" -> (known after apply)
      ~ s3_key                         = "python.4febb565357cbdc0dc8ef3e03587ec5b.zip" -> "python.f656035ae26fb7ab6ff388c2c2852228.zip"
        tags                           = {}
      ~ version                        = "91" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "90926da689abe44e4697df207443aa4e2ac03740" -> "59d14f10b12007814c5763dcadcb99d4fe2bd721"
              ~ "DD_TAGS"                      = "git.commit.sha:90926da689abe44e4697df207443aa4e2ac03740,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:59d14f10b12007814c5763dcadcb99d4fe2bd721,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "90926da689abe44e4697df207443aa4e2ac03740" -> "59d14f10b12007814c5763dcadcb99d4fe2bd721"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "91" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:139" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:139/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "139" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "90926da689abe44e4697df207443aa4e2ac03740" -> "59d14f10b12007814c5763dcadcb99d4fe2bd721"
              ~ "DD_TAGS"                            = "git.commit.sha:90926da689abe44e4697df207443aa4e2ac03740,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:59d14f10b12007814c5763dcadcb99d4fe2bd721,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "90926da689abe44e4697df207443aa4e2ac03740" -> "59d14f10b12007814c5763dcadcb99d4fe2bd721"
                # (18 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "139" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:47" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:47/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "47" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "90926da689abe44e4697df207443aa4e2ac03740" -> "59d14f10b12007814c5763dcadcb99d4fe2bd721"
              ~ "DD_TAGS"                            = "git.commit.sha:90926da689abe44e4697df207443aa4e2ac03740,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:59d14f10b12007814c5763dcadcb99d4fe2bd721,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "90926da689abe44e4697df207443aa4e2ac03740" -> "59d14f10b12007814c5763dcadcb99d4fe2bd721"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "47" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8913386986)*